Revit 2024 API
FabricationServiceButton.GetImage Method
Gets the image for fabrication service button.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public virtual Bitmap GetImage()
Visual Basic
Public Overridable Function GetImage As Bitmap
Visual C++
public:
virtual Bitmap^ GetImage()
Return Value
System.Drawing.Bitmap represents the fabrication service button image. null if there is no preview image.
See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace